Repository: mozilla-l10n/mt-training-data
Catalog: zu/zu_pontoon.tmx
Source language: en_us
Languages: zu

source: This happened
zu: Lokhu kwenzekile

source: This happens
zu: Lokhu kuyenzeka

source: This image is not included in any articles.
zu: Lo mfanekiso awubandakanyiwe kwamanye ama-athikhili.

source: This information gives details about the internal workings of your browser that will help in answering your question.
zu: Le mininingwane inikeza ulwazi mayelana nokusebenza kwangaphakathi kwesiphequluli sakho esizokusiza ukuphendula umbuzo wakho.

source: This is a staging site, the content gets overwritten on the 1st of every month.<br>The production site is <a href="http://support.mozilla.org">here</a>.
zu: Le yisayithi nje eyisibonelo, okubhalwe khona kuyaphelelwa njalo ngomhlaka-1 njalo enyangeni.<br>Isayithi yokwenza yi <a href="http://support.mozilla.org">lapha</a>.

source: This is the number of all Knowledge Base articles that are ready to be localized.
zu: Leli yinani lawo wonke ama-athikhili Asekelwe Olwazini aselungele ukubhalwa njengawasendaweni.

source: This is your current email.
zu: Nansi i-meyli oyisebenzisa njengamanje.

source: This page doesn't have a mobile optimized version. Tap here to go back.
zu: Leli khasi alinayo iveshini elungiselwe umakhalekhukhwini. Thinta lapha ukuze ubuyele emuva.

source: This question already has a solution.
zu: Lo mbuzo usunaso isisombululo vele.

source: This question has not been asked before.
zu: Lo mbuzo awukaze ubuzwe ngaphambilini.

source: This revision is not ready for localization.
zu: Lesi sibukezo asikalungeli ukuhunyushwa.

source: This revision is ready for localization.
zu: Lesi sibukezo sesilungele ukuhunyushwa.

source: This revision was already reviewed by {user} on {date}.
zu: Lesi sibukezo bese sivele sibukeziwe ngu {user} ngomhlaka {date}.

source: This started when...
zu: Lokhu kwaqala ngenkathi...

source: This thread has been locked. It is no longer possible to post new replies.
zu: Lolu chungechunge lukhiyiwe. Awusakwazi ukuphosta impendulo entsha.

source: This thread was archived.
zu: Lolu chungechunge lwabekwa kunqolobane.

source: This thread was closed.
zu: Lolu chungechunge beluvaliwe.

source: This thread was closed and archived.
zu: Lolu chungechunge lwavalwa lwabekwa kunqolobane.

source: This translation was already reviewed by {user} on {date}.
zu: Lesi sihumusho sesibukeziwe ngu {user} ngomhlaka {date}.

source: This tweet doesn't need a response
zu: Le tweet ayidingi mpendulo

source: This user has been deactivated.
zu: Lo msebenzisi usesuliwe.

source: This username is already taken!
zu: Leli gama lomsebenzisi selithathiwe!

source: This username is available.
zu: Leli gama lomsebenzisi alisatholakali.

source: This will help other Firefox users find good answers to their questions!
zu: Lokhu kuzosiza abanye abasebenzisi be-Firefox bathole izimpendulo ezilungile emibuzweni yabo!

source: This will notify localizers and translations will be marked as "needing updates" on dashboards. Most changes&mdash;updating an image, fixing {for} markup, adding or removing non-critical sections&mdash;should use this.
zu: Lokhu kuzokwazisa kuphela abahumushi izihumusho zizophawulwa ngokuthi "kusadinga ukuvuselelwa" kumadeshibhodi. Izinguquko eziningi &mdash;ukuvuselela umfanekiso, ukulungise {for} la ukuphawula, ukufaka noma ukukhipha izigaba ezingebucayi&mdash;.

source: This will notify localizers and translations will be marked "out of date" on dashboards. Translations will show a warning to users that they are out of date and that the English version is the most accurate. Use this when the old instructions are completely unusable.
zu: Lokhu kuzokwazisa abahumushi izihumusho zizophawulwa ngokuthi "kuphelelwe yisikhathi" kumadeshibhodi. Izihumusho zizokhombisa isexwayiso kubasebenzisi sokuthi sebephelelwe yisikhathi nokuthi iveshini yesiNgisi yiyona enembayo. Sebenzisa lokhu uma imiyalelo emidala ingasasebenziseki nhlobo.

source: Thread contains
zu: Uchungechunge luqukethe

source: Thread type
zu: Uhlobo lochungechunge

source: Thunderbird
zu: I-Thunderbird

source: Thunderbird controls and buttons
zu: Izilawuli ze-Thunderbird nezinkinobho

source: Thunderbird crashes
zu: I-Thunderbird iyakhresha

source: Thunderbird is slow or stops working
zu: I-Thunderbird ihamba kancane noma iyama ukusebenza

source: Thunderbird options, preferences and settings
zu: Izinketho ze-Thunderbird, okuncanyelwayo namasethingi

source: Thunderbird versions and languages
zu: Amaveshini e-Thunderbird nezilimi

source: Thunderbird won't save settings or remember information
zu: I-Thunderbird ngeke iwalondoloze amasethingi noma ikhumbule imininingwane

source: Timezone
zu: Isizinda sesikhathi esithile

source: Tips and tricks
zu: Amasu namacebo

source: Title
zu: Isihloko

source: Title:
zu: Isihloko:

source: {title} has a revision ready for localization
zu: {title} inezilungiso ezilindele abahumushi

source: Title in {locale}:
zu: Isihloko nge {locale}:

source: {title} is ready for review ({creator})
zu: {title} isilungele ukubukezwa ({creator})

source: {title} ({locale}) has a new approved revision ({reviewer})
zu: {title} ({locale}) inesilungiso esisha esigunyaziwe ({reviewer})

source: {title} | Media Gallery
zu: {title} | Igalari Yemidiya

source: Title of article
zu: Isihloko se-athikhili

source: {title} was edited by {creator}
zu: {title} ilungiswe ngu {creator}

source: To:
zu: Iya:

source: To activate your account you must first confirm your email address. Enter your email and submit the form below, and we will resend the confirmation email.
zu: Ukuze uqalise ukusebenza kwe-akhawunti yakho kufanele kuqala uqinisekise ikheli le-imeyli yakho. Faka i-imeyli yakho bese uhambisa ifomu elingezansi, sizobe sesithumela kabusha i-imeyli yokuqinisekisa.

source: To confirm your subscription, please click the link below or copy and paste the whole thing into your browser's location bar:
zu: Ukuze uqinisekise ukubhalisa, uyacelwa uchofoze ilinki engezansi noma kopisha unamathelise yonke lento esikhaleni sesiphequluli sakho:

source: Today at %s
zu: Namuhla imi ku%s

source: To delete the document, please notify an admin.
zu: Ukuze udilithe idokhumenti, uyacelwa wazise abengamele isayithi.

source: To field is required.
zu: Ifildi iyadingeka.

source: Toggle Diff
zu: I-toggle diff

source: Toggle syntax highlighting
zu: Ukudonswa okugqamisa imisho

source: To help you find out where to help check this site:
zu: Ukuze sikusize uthole lapho ungasiza khona ungabheka le sayithi:

source: To localize the document, click the following link, or paste it into your browser's location bar:
zu: Ukuze umise le dokhumenti njengokwasendaweni, chofoza ilinki elandelayo, noma uyinamathisele esikhali sesiphequluli:

source: Too long
zu: Kude kakhulu

source: Tools for creating and teaching the web
zu: Amathuluzi okwakha nokufundisa iwebhu

source: Top 100 Articles
zu: Ama-athikhili ayi-100 Aphezulu

source: Top 10 Contributor
zu: Abanegalelo Abayi-10 Abaphambili

source: Top 20 Articles
zu: Ama-athikhili angama-20 Aphezulu

source: Top 25 Contributor
zu: Abanegalelo Abangama-25 Abaphambili

source: Top 50 Articles
zu: Ama-athikhili angama-50 Aphezulu

source: Top contributors
zu: Abanegalelo abaphezulu

source: Top Contributors
zu: Abanegalelo Abaphezulu

source: Top Contributors - Army of Awesome
zu: Abanegalelo Abaphezulu - Ithimba Labaphambili

source: Top Contributors - Knowledge Base
zu: Abanegalelo Abaphezulu - Isisekelo Solwazi

source: Top Contributors - Localization
zu: Abanegalelo Abaphezulu - Ukwenziwa njengokwasendaweni

source: Top Contributors - Support Forum
zu: Abanegalelo Abaphezulu - Isithangami Sabesekayo

source: Topic
zu: Isihloko

source: Topics
zu: Izihloko

source: Topics:
zu: Izihloko:

source: To post your question, please create a support account
zu: Ukuze uphoste umbuzo wakho, uyacelwa ukuba wenze i-akhawunti yokweseka

source: To review this revision, click the following link, or paste it into your browser's location bar:
zu: Ukuze ubukeze lesi sibukezo, chofoza ilinki elandelayo, noma yinamathisele esikhaleni sesiphequluli sakho:

source: Total:
zu: Isamba esiphelele:

source: Total questions: <strong>{num}</strong>
zu: Imibuzo isiyonke: <strong>{num}</strong>

source: Total Votes
zu: Amavoti Esewonke

source: To view the history of this document, click the following link, or paste it into your browser's location bar:
zu: Ukuze ubuke umlando wale dokhumenti, chofoza ilinki elandelayo, noma yinamathelise esikhaleni sesiphequluli:

source: To view the updated document, click the following link, or paste it into your browser's location bar:
zu: Ukuze ukwazi ukubuka idokhumenti esivuselelwe, chofoza ilinki elandelayo, noma uyinamathelise esikhaleni sesiphequluli:

source: To view this document's history, click the following link, or paste it into your browser's location bar:
zu: Ukuze ubuke umlando wedokhumenti, chofoza ilinki elandelayo, noma uyinamathisele esikhaleni sesiphequluli:

source: To view this post on the site, click the following link, or paste it into your browser's location bar:
zu: Ukuze ukwazi ukubuka le phosti kulesi sizinda, chofoza ilinki elandelayo, noma yinamathelise emugqeni wesiphequluli sakho:

source: Transaction ID:
zu: I-Transaction ID:

source: Translate Article
zu: Humusha I-athikhili

source: Translate Article | {document}
zu: Humusha I-athikhili | {document}

source: Translate Content
zu: Humusha Okuqukethwe

source: Translate Description
zu: Humusha Incazelo

source: Translate help articles!
zu: Humusha ama-athikhili osizo!

source: Translate Help Articles
zu: Humusha Ama-athikhili Osizo

source: Translate help articles to your language
zu: Siza ukuhumusha ama-athikhili olimini lwakho

source: Translate help to your languages
zu: Humushela usizo ezilimini zakho

source: Translating 1 article can help 1,000's of users in your language
zu: Ukuhumusha i-athikhili e-1 kungasiza abasebenzisi abayi-1 000 olimini lwakho

source: Translating article to {locale}
zu: Uhumushela isihloko ku {locale}

source: Translating {title}
zu: Uhumusha {title}

source: Translation Comment: {comment}
zu: Ukuphawula Ngesihumusho {comment}

source: Translation keywords:
zu: Amagama aqavile esihumusho:

source: Translation Needed
zu: Kudingeka Ukuhumusha

source: Translation rendered html:
zu: Isihumusho esinikeziwe se-html:

source: Translation search results summary:
zu: Isifingqo semiphumela yokucinga isihumusho:

source: Translation source:
zu: Umthombo wesihumusho:

source: Trash
zu: Uvobe

source: Troubleshoot error message on Firefox for iOS
zu: Umyalezo wendlela yokulungisa iphutha ku-Firefox ye-iOS

source: Troubleshoot error messages on Thunderbird.
zu: Imiyalezi yokulandelelwa kwamaphutha kuThunderbird.

source: Troubleshooting
zu: I-Troubleshooting

source: Troubleshooting Information
zu: Imininingwane yokulandelela izinkinga

source: Try another topic
zu: Zama esinye isihloko

source: Try one of these articles:
zu: Zama enye yala ma-athikhili:

source: Turn off emails for discussion in my locale.
zu: Cima ama-imeyili okuxoxa endaweni.

source: Tweak it and make it your own. Personalized messages go a long way in helping others.
zu: Yilungise ihambelane nawe. Imiyalezo yakho isiza kakhulu abanye.

source: Tweet has already been replied to
zu: I-tweet isiphenduliwe vele

source: Tweets that are replies or have replies must not be hidden.
zu: Ama-tweet ayizimpendulo noma anezimpendulo makangafihlwa.

source: {t} with id={id} no longer exists.
zu: {t} ne-id={id} akusekho.

source: Twitter
zu: I-Twitter

source: Twitter account
zu: Lawula ama-akhawunti e-Twitter

source: Twitter Contributor - Respond to tweets about Firefox:
zu: Onegalelo ku-Twitter - Phendula imiyalezo ye-twitter mayelana ne-Firefox:

source: Twitter Handles:
zu: Izibambo ze-Twitter:

source: Twitter Username
zu: Igama lomsebenzisi le-Twitter

source: Type
zu: Uhlobo

source: Type of article
zu: Uhlobo lwe-athikhili

source: Unable to change email for user {username}
zu: Asikwazi ukushintshela lo muntu i-imeyli {username}

source: Unable to delete only revision of the document
zu: Ayikwazi ukudilitha isibukezo kuphela sedokhumenti

source: Unanswered
zu: Akuphendulwanga

source: Unarchive this question
zu: Khipha lo mbuzo enqolobaneni

source: Unban
zu: Hoxisa ukuvimbela

source: Unblock Firefox from connecting to the Internet
zu: Yekisa ukubhulokha i-Firefox ukuba ixhume ku-inthanethi

source: Unblock Thunderbird from connecting to the Internet
zu: Hoxisa ukuvimba i-Thunderbird ekuxhumeni ku-inthanethi

source: Undo
zu: Susa okwenzile

source: Unhelpful
zu: Okungenasizo

source: Unhelpful Documents
zu: Amadokhumenti Angesilo Usizo

source: Unlock this question
zu: Vula lo mbuzo

source: Unlock this thread
zu: Hoxisa ukukhiywa kwalolu chungechunge

source: Unmark as spam
zu: Hoxisa ukuphawula njenge-spam

source: Unrecognized media type.
zu: Uhlobo lwemidiya olungaziwa.

source: Unrecognized request or nothing to cancel.
zu: Isicelo esingaziwa noma akukho okungakhanselwa.

source: Unreviewed
zu: Akukabukezwa

source: Unreviewed Changes
zu: Izinguquko Ezingabukeziwe

source: Unsticky this thread
zu: Yekisa ukuba sekuqaleni kwalolu chungechunge

source: Unsubscribe
zu: Zisuse ohlwini lwababhalisela ukuthola imininingwane

source: Unsubscribe from edit notifications
zu: Zikhiphe ekutholeni izaziso zokulungisa

source: Unsubscribe from these emails
zu: Hoxisa igama lakho ekutholeni la ma-imeyli

source: Unsubscribe from these emails:
zu: Hoxisa ukubhalisela ukuthola imibiko yala ma-imeyli:

source: Update
zu: Vuselela

source: Update answer
zu: Faka okusha kule mpendulo

source: Updated
zu: Kuvuselelwe

source: Updated:
zu: Okuvuselelwe:

source: Updated date. Format: mm/dd/yy
zu: Usuku lokuvuselela. Ifomethi: mm/dd/yy

source: Update Needed
zu: Ukuvuselela Kuyadingeka

source: Update post
zu: Vuselelea iphosti

source: Update Status:
zu: Vuselela i-status:

source: Update thread
zu: Vuselela uchungechunge lwengxoxo

source: Upload
zu: Loda

source: Upload a New Media File
zu: Loda Ifayela Yemidiya Entsha

source: Upload cancelled. Please select an image file.
zu: Ukuloda kukhanseliwe. Uyacelwa ukhethe isithombe sefayela.

source: Uploaded {date}
zu: Ilodwe {date}

source: Uploaded images:
zu: Imifanekiso elodiwe:

source: Upload file
zu: Loda ifayela

source: Uploading "%s"...
zu: Iyaloda"%s"...

source: Upload Media
zu: Loda imidiya

source: URL of affected site
zu: I-URL yesayithi ethintekayo

source: Use advanced search
zu: Sebenzisa ukucinga kweqophelo eliphezulu

source: Use basic search
zu: Sebenzisa ukucinga okuyisisekelo

source: Use bookmarks
zu: Sebenzisa amabhukumaka

source: Used by more than 400 million people, Mozilla support is fully powered by volunteers, and its more important than ever. This is where you come in.
zu: Isetshenziswa abantu abangaphezu kwezigidi ezingama-400, ukweseka kwe-Mozilla kuxhaswe ngamavolontiya ngokuphelele, futhi sekubaluleke kakhulu kunangaphambilini. Wena-ke ungena lapha.

source: user
zu: umsebenzisi

source: User
zu: Umsebenzisi

source: User Agent: {ua}
zu: I-ejenti Engumsebenzisi: {ua}

source: User Agent: {user_agent}
zu: Umsebenzisi oyi-ejenti: {user_agent}

source: User Control
zu: Ukulawula Komsebenzisi

source: {user} | Documents
zu: {user} | Amadokhumenti

source: User Interface
zu: I-interface yomsebenzisi

source: {user} is currently working on this problem.
zu: {user} umatasa ngale nkinga njengamanje.

source: username
zu: igama lomsebenzisi

source: Username
zu: Igama lomsebenzisi

source: Username:
zu: Igama lomsebenzisi:

source: Username, Display Name or Twitter Handle
zu: Igama lomsebenzisi, Khombisa Igama noma Isibambo se-Twitter

source: {username} is not a valid username.
zu: {username} alilona igama lomsebenzisi elisebenzayo.

source: Username is required.
zu: Kudingeka igama lomsebenzisi.

source: Username is too long (%(show_value)s characters). It must be %(limit_value)s characters or less.
zu: Igama lomsebenzisi lide kakhulu (%(show_value)s ezinhlamvu). Kufanele libe okungenani ezi- %(limit_value)s izinhlamvu.

source: Username is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
zu: Igama lomsebenzisi lifishane kakhulu (%(show_value)s ezinhlamvu). Kufanele libe okungenani ezi- %(limit_value)s izinhlamvu.

source: Username may contain only English letters, numbers and ./-/_ characters.
zu: Igama lomsebenzisi kungenzeka libe nezinhlamvu zamagama esiNgisi, izinombolo kanye nalezi zinhlamvu ./-/_.

source: Username not provided.
zu: Igama lomsebenzisi alihlinzekwanga.

source: {user} - {num} contributions in last 90 days
zu: {user} - {num} labanegalelo ezinsukwini ezingama-90 ezidlule

source: {user} | Profile
zu: {user} | Iphrofayela

source: {user} removed from successfully!
zu: {user} ukhishwe ngempumelelo!

source: {user} removed from the contributors successfully!
zu: {user} ususwe ngempumelelo kwabanegalelo!

source: {user} removed from the group leaders successfully!
zu: {user} ukhishwe eqenjini labaholi ngempumelelo!

source: {user} removed from the group successfully!
zu: {user} ukhishwe eqenjini ngempumelelo!

source: Users:
zu: Abasebenzisi:

source: {users} added successfully!
zu: {users} bafakwe ngempumelelo!

source: {users} added to the contributors successfully!
zu: {users} abafakwe kwabanegalelo ngempumelelo!

source: {users} added to the group leaders successfully!
zu: {users} bafakwe eqenjini labaholi ngempumelelo!

source: {users} added to the group successfully!
zu: {users} bafakwe ngempumelelo eqenjini!

source: {user}'s Groups
zu: {user}'s Amaqembu

source: Using a feature on webmaker.org
zu: Ukusebenzisa ifisha ku-webmaker.org

source: Using Popcorn Maker
zu: Ukusebenzisa i-Popcorn Maker

source: Using Thimble
zu: Ukusebenzisa i-Thimble

source: Using X-Ray Goggles
zu: Ukusebenzisa ama-X-Ray Goggles

source: Value
zu: Inani lentengo

source: Verify your email address:
zu: Qinisekisa ikheli lakho le-imeyli:

source: Video, audio and interactive settings
zu: Ividiyo, i-odiyo namasethingi aphendulayo

source: Videos
zu: Amavidiyo

source: Videos, sound, pictures and animations don't work
zu: Amavidiyo, umsindo, izithombe kanye nopopayi akusebenzi

source: View a list of all Firefox OS articles
zu: Buka lonke uhla lwe-Firefox OS

source: View all deactivated users
zu: Buka bonke abasebenzisi abacishiwe

source: View all Firefox OS articles
zu: Buka wonke ama-athikhili e-Firefox OS

source: View Diff
zu: Buka Izinguquko

source: View other questions that need attention.
zu: Buka eminye imibuzo edinga ukubhekwa.

source: View Profile
zu: Buka Iphrofayela

source: Views
zu: Ukubukwa

source: View the history of this document
zu: Buka umlando wale dokhumenti

source: View the solution
zu: Buka isisombululo

source: View the updated document
zu: Buka idokhumenti evuselelwe

source: View this document's history
zu: Buka umlando wale dokhumenti

source: View this message on the web
zu: Buka lo myalezo kuwebhu

source: View this message on the web:
zu: Buka lo myalezo kuwebhu:

source: View this post on the site.
zu: Buka le pohosti esayithini.

source: Visitors
zu: Abavakashile

source: Visits
zu: Ukuvakasha

source: Visits in last 30 days
zu: Ukuvakasha ezinsukwini ezingama-30 ezidlule

source: Volunteer for Mozilla Support
zu: Yiba yivolontiya ku-Mozilla Support

source: Votes
zu: Amavoti

source: votes this week
zu: amavoti kuleli sonto

source: Waiting for review
zu: Kulindelwe isibukezo

source: Want to know when a solution is found?
zu: Ufuna ukwazi lapho isisombululo sesitholakele?

source: WARNING! Are you sure you want to deactivate this user? This cannot be undone!
zu: ISEXWAYISO! Uneqiniso lokuthi ufuna ukucima lo msebenzisi? Lokhu akuhlehliseki!

source: Warning: There are newer unreviewed revisions of this article.
zu: Isexwayiso: Kunezibukezo zale athikhili ezintshwa ezingekabukezwa.

source: Warning: This page is also being edited by %(user)s!
zu: Isexwayiso: Leli khasi nalo liyahlelwa ngu%(user)s!

source: was marked as solved by its asker, {asker}.
zu: uphawulwe njengosonjululwe umbuzi wawo, {asker}.

source: Was this article helpful?
zu: Ingabe le athikhili ibe usizo?

source: Was this helpful to you?
zu: Ingabe lokhu kube usizo kuwena?

source: Watch
zu: Buka

source: Watch forum threads I comment in
zu: Buka isithangami sochungechunge engiphawula kulona

source: Watch forum threads I start
zu: Buka isithangami sochungechungechunge engiluqalayo

source: Watch KB discussion threads I comment in
zu: Buka uchungechunge lwengxoxo ye-KB engiphawule kulo

source: Watch KB discussion threads I start
zu: Buka izingxoxo zochungechunge lwe-KB ezingiqalayo

source: Watch our videos and check our documentation
zu: Buka amavidiyo ethu ubheke nemibhalo esiyibhalile

source: Watch Question threads I comment in
zu: Buka uchungechunge Lwemibuzo engiphawule kuyo

source: Watch this forum
zu: Buka lesi sithangami

source: Watch this locale
zu: Buka le ndawo

source: Watch this thread
zu: Buka lolu chungechunge

source: We are always very happy to hear from new people who like helping on the forums so if you havent met our community yet <a href="%(intro_url)s"> please take a minute to introduce yourself </a>. If you want to stay low-profile, thats also ok :). You can also find us all hanging out on IRC, on the <a href="%(irc_url)s"> #sumo channel </a>.
zu: Sihlale sikuthokozela ukuzwa kubantu abasha abathanda ukusiza ezinkundleni zokusiza ngakho-ke uma ungakahlangani nomphakathi wethu <a href="%(intro_url)s"> sicela uthathe umzuzu uzazise </a>. Uma ungathandi ukwaziwa nalokho kulungile :). Ungasithola sizihlalele ku-IRC, esiteshini <a href="%(irc_url)s"> #sumo </a>.

source: We are always very happy to hear from new people who like helping on the forums so if you havent met our community yet please take a minute to introduce yourself. If you want to stay low-profile, thats also ok :). You can also find us all hanging out on IRC, on the #sumo channel on irc.mozilla.org.
zu: Sihlala sikuthokozela ukuzwa kubantu abasha abathanda ukusiza ezinkundleni ngakho-ke uma ungakahlangani nomphakathi wethu sicela uthathe umzuzu uzazise. Uma ufuna ukuhlala ungaziwa, nalokho kulungile :). Ungabuye usithole sizihlalele ku-IRC, esiteshsini se- #sumo channel ku- irc.mozilla.org.

source: We are having trouble reaching your email address. Please try a different address or contact an administrator.
zu: Sinenkinga ukufinyelela ikheli lakho le-imeyli. Uyacelwa uzame ikheli elehlukile noma uthinte owengamele.

source: Web browser for Android smartphones and tablets
zu: Isiphequluli sewebhu sama-smartphone namathebhulethi e-Android

source: Web browser for Windows, Mac and Linux
zu: Isiphequluli sewebhu ye-Windows, Mac ne-Linux

source: Webmaker
zu: I-webmaker

source: Website
zu: Iwebhusayithi

source: Websites
zu: Amawebhusayithi

source: We could not activate your account. Please make sure that you have clicked the correct link in your email or typed in the correct address.
zu: Asikwazanga ukuqalisa ukusebenza kwe-akhawunti yakho. Uyacelwa uqinisekise ukuthi uchofoze ilinki elungile ku-imeyli noma ubhale ikheli eliyilo.

source: We could not unsubscribe you from this question: <a href="%(question_url)s">%(question_title)s</a>. Please make sure you copied and pasted the unsubscribe link correctly.
zu: Asikwazanga ukukukhipha ekubhaliseleni ukuthola izindaba ngalo mbuzo: <a href="%(question_url)s">%(question_title)s</a>. Uyacelwa ukuba uqinisekise ukuthi ukopishe wanamathisela ilinki yokuhoxisa ukuthola izindaba ngendlela eyiyo.
